# GetWireCenterlines Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheet..::..GetWireCenterlines Method
FabricSheet Class See Also
---
Gets a list of curves representing the wires centerlines of the Fabric Sheet in the both distribution directions.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<Curve> GetWireCenterlines()
```

Visual Basic
---
```text
Public Function GetWireCenterlines As IList(Of Curve)
```

Visual C++
---
```text
public:
IList<Curve^>^ GetWireCenterlines()
```

# ### Return Value
The centerline curves.
# See Also
FabricSheet Class
GetWireCenterlines Overload
Autodesk.Revit.DB.Structure Namespace